# Pandas 리마인드

### 실습 1 : 데이터 살펴보기

* Q0. 라이브러리 불러오기

In [3]:
import pandas as pd
import numpy as np

* Q1. pandas read_csv 함수를 이용하여 파일을 읽고, titanic 변수에 담습니다. 
    * 링크 : https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic.0.csv

In [4]:
titanic = pd.read_csv('https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic.0.csv')

* Q2. titanic의 shape를 확인합니다.

In [5]:
titanic.shape

(891, 12)

* Q3. titanic의 칼럼명과 각 칼럼의 데이터 타입을 확인합니다.

In [6]:
(titanic.columns, titanic.dtypes)

(Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
        'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
       dtype='object'),
 PassengerId      int64
 Survived         int64
 Pclass           int64
 Name            object
 Sex             object
 Age            float64
 SibSp            int64
 Parch            int64
 Ticket          object
 Fare           float64
 Cabin           object
 Embarked        object
 dtype: object)

In [7]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

* Q4. titanic의 데이터의 첫 3행의 데이터와 마지막 3행의 데이터를 출력합니다.

In [8]:
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [9]:
titanic.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

* Q5. 기초 통계량을 조회합시다.

In [10]:
titanic.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [11]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

* Q6. titanic의 데이터를 'Fare' 칼럼을 기준으로 내림차순으로 정렬합니다.

In [12]:
titanic.sort_values(by=['Fare'], ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0000,NaN,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0000,NaN,S
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0000,NaN,S

* Q7. 운임('Fare')을 가장 많이 내고 탄 사람 10명을 조회하시오.

In [13]:
titanic.sort_values(by='Fare', ascending=False).head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C

### 실습 2 : 데이터 조회하기

* Q0. 라이브러리 불러오기

In [14]:
import pandas as pd

* Q1. pandas read_csv 함수를 이용하여 파일을 읽고 boston 변수에 담습니다.

    * 링크 : https://raw.githubusercontent.com/DA4BAM/dataset/master/boston2.csv

In [15]:
boston = pd.read_csv('https://raw.githubusercontent.com/DA4BAM/dataset/master/boston2.csv')

* Q2. boston의 shape를 확인합니다.

In [16]:
boston.shape

(506, 14)

* Q3. boston의 crim 변수를 Series 형태로 조회하시오.

In [17]:
boston['crim']

0      0.00632
1      0.02731
2      0.02729
3      0.03237
4      0.06905
        ...
501    0.06263
502    0.04527
503    0.06076
504    0.10959
505    0.04741
Name: crim, Length: 506, dtype: float64

* Q4. boston의 crim 변수를 DataFrame 형태로 조회하시오.

In [18]:
boston[['crim']]

        crim
0    0.00632
1    0.02731
2    0.02729
3    0.03237
4    0.06905
..       ...
501  0.06263
502  0.04527
503  0.06076
504  0.10959
505  0.04741

[506 rows x 1 columns]

* Q5. .loc을 이용하여 10행까지, 열은 crim, lstat, medv를 조회하시오.

In [19]:
boston[['crim', 'lstat', 'medv']].loc[:9]

      crim  lstat  medv
0  0.00632   4.98  24.0
1  0.02731   9.14  21.6
2  0.02729   4.03  34.7
3  0.03237   2.94  33.4
4  0.06905   5.33  36.2
5  0.02985   5.21  28.7
6  0.08829  12.43  22.9
7  0.14455  19.15  27.1
8  0.21124  29.93  16.5
9  0.17004  17.10  18.9

In [20]:
boston.loc[:9, ['crim', 'lstat', 'medv']]

      crim  lstat  medv
0  0.00632   4.98  24.0
1  0.02731   9.14  21.6
2  0.02729   4.03  34.7
3  0.03237   2.94  33.4
4  0.06905   5.33  36.2
5  0.02985   5.21  28.7
6  0.08829  12.43  22.9
7  0.14455  19.15  27.1
8  0.21124  29.93  16.5
9  0.17004  17.10  18.9

* Q6. .iloc을 이용하여 Q5와 동일한 결과를 내시오.

In [21]:
boston.iloc[:10, [0, -3, -2]]

      crim  lstat  medv
0  0.00632   4.98  24.0
1  0.02731   9.14  21.6
2  0.02729   4.03  34.7
3  0.03237   2.94  33.4
4  0.06905   5.33  36.2
5  0.02985   5.21  28.7
6  0.08829  12.43  22.9
7  0.14455  19.15  27.1
8  0.21124  29.93  16.5
9  0.17004  17.10  18.9

In [22]:
boston.iloc[:10, [0, 11, 12]]

      crim  lstat  medv
0  0.00632   4.98  24.0
1  0.02731   9.14  21.6
2  0.02729   4.03  34.7
3  0.03237   2.94  33.4
4  0.06905   5.33  36.2
5  0.02985   5.21  28.7
6  0.08829  12.43  22.9
7  0.14455  19.15  27.1
8  0.21124  29.93  16.5
9  0.17004  17.10  18.9

### 실습 3 : 원하는 데이터 조회하기

* Q0. 라이브러리 불러오기

* Q1. 아래 링크에서 데이터를 읽어 boston으로 저장합니다.

    * https://raw.githubusercontent.com/DA4BAM/dataset/master/boston2.csv

In [22]:
boston = pd.read_csv('https://raw.githubusercontent.com/DA4BAM/dataset/master/boston2.csv')

Q2. boston의 shape를 확인합니다.

In [23]:
boston.shape

(506, 14)

* Q3. boston의 칼럼명과 각 칼럼의 데이터 타입을 확인합니다.

In [24]:
boston.columns

Index(['crim', 'indus', 'chas', 'nox', 'rm', 'age', 'dis', 'rad', 'tax',
       'ptratio', 'black', 'lstat', 'medv', 'zn2'],
      dtype='object')

In [25]:
boston.dtypes

crim       float64
indus      float64
chas         int64
nox        float64
rm         float64
age        float64
dis        float64
rad          int64
tax          int64
ptratio    float64
black      float64
lstat      float64
medv       float64
zn2          int64
dtype: object

In [26]:
boston.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   crim     506 non-null    float64
 1   indus    506 non-null    float64
 2   chas     506 non-null    int64
 3   nox      506 non-null    float64
 4   rm       506 non-null    float64
 5   age      506 non-null    float64
 6   dis      506 non-null    float64
 7   rad      506 non-null    int64
 8   tax      506 non-null    int64
 9   ptratio  506 non-null    float64
 10  black    506 non-null    float64
 11  lstat    506 non-null    float64
 12  medv     506 non-null    float64
 13  zn2      506 non-null    int64
dtypes: float64(10), int64(4)
memory usage: 55.5 KB

* Q4. unique 함수를 가지고 'zn2'의 칼럼에 들어있는 값의 종류를 확인합니다.

In [27]:
boston['zn2'].unique()

array([1, 0, 2])

* Q5. 타운들에 대해서 전체 평균 집값(medv)을 구하시오.

    * 평균 : .mean( )

In [28]:
boston['medv'].mean()

22.532806324110698

* Q6. 찰스강변(chas == 1)이면서 집값(medv)이 전체 평균보다 낮은 데이터를 조회하시오.

In [33]:
boston.loc[(boston['chas'] == 1) & (boston['medv'] < boston['medv'].mean())]

,crim,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,zn2
142,3.32105,19.58,1,0.871,5.403,100.0,1.3216,5,403,14.7,396.90,26.82,13.4,0
152,1.12658,19.58,1,0.871,5.012,88.0,1.6102,5,403,14.7,343.28,12.12,15.3,0
154,1.41385,19.58,1,0.871,6.129,96.0,1.7494,5,403,14.7,321.02,15.12,17.0,0
155,3.53501,19.58,1,0.871,6.152,82.6,1.7455,5,403,14.7,88.01,15.02,15.6,0
209,0.43571,10.59,1,0.489,5.344,100.0,3.8750,4,277,18.6,396.90,23.09,20.0,0
210,0.17446,10.59,1,0.489,5.960,92.1,3.8771,4,277,18.6,393.25,17.27,21.7,0
211,0.37578,10.59,1,0.489,5.404,88.6,3.6650,4,277,18.6,395.24,23.98,19.3,0
212,0.21719,10.59,1,0.489,5.807,53.8,3.6526,4,277,18.6,390.94,16.03,22.4,0
218,0.11069,13.89,1,0.550,5.951,93.8,2.8893,5,276,16.4,396.90,17.92,21.5,0
221,0.40771,6.20,1,0.507,6.164,91.3,3.0480,8,307,17.4,395.24,21.46,21.7,0
269,0.09065,6.96,1,0.464,5.920,61.5,3.9175,3,223,18.6,391.34,13.65,20.7,1
356,8.98296,18.10,1,0.770,6.212,97.4,2.1222,24,666,20.2,377.73,17.60,17.8,0
357,3.84970,18.10,1,0.770,6.395,91.0,2.5052,24,666,20.2,391.34,13.27,21.7,0
363,4.22239,18.10,1,0.770,5.803,89.0,1.9047,24,666,20.2,353.04,14.64,16.8,0
364,3.47428,18.10,1,0.718,8.780,82.9,1.9047,24,666,20.2,354.55,5.29,21.9,0

* Q7. 범죄율이 5% ~ 10% 사이의 데이터를 조회하시오.

In [51]:
boston.loc[boston['crim'].between(5, 10, inclusive='both'), :]

,crim,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,zn2
356,8.98296,18.1,1,0.770,6.212,97.4,2.1222,24,666,20.2,377.73,17.60,17.8,0
358,5.20177,18.1,1,0.770,6.127,83.4,2.7227,24,666,20.2,395.43,11.48,22.7,0
369,5.66998,18.1,1,0.631,6.683,96.8,1.3567,24,666,20.2,375.33,3.73,50.0,0
370,6.53876,18.1,1,0.631,7.016,97.5,1.2024,24,666,20.2,392.05,2.96,50.0,0
371,9.23230,18.1,0,0.631,6.216,100.0,1.1691,24,666,20.2,366.15,9.53,50.0,0
372,8.26725,18.1,1,0.668,5.875,89.6,1.1296,24,666,20.2,347.88,8.88,50.0,0
377,9.82349,18.1,0,0.671,6.794,98.8,1.3580,24,666,20.2,396.90,21.24,13.3,0
382,9.18702,18.1,0,0.700,5.536,100.0,1.5804,24,666,20.2,396.90,23.60,11.3,0
383,7.99248,18.1,0,0.700,5.520,100.0,1.5331,24,666,20.2,396.90,24.56,12.3,0
389,8.15174,18.1,0,0.700,5.390,98.9,1.7281,24,666,20.2,396.90,20.85,11.5,0
390,6.96215,18.1,0,0.700,5.713,97.0,1.9265,24,666,20.2,394.43,17.11,15.1,0
391,5.29305,18.1,0,0.700,6.051,82.5,2.1678,24,666,20.2,378.38,18.76,23.2,0
393,8.64476,18.1,0,0.693,6.193,92.6,1.7912,24,666,20.2,396.90,15.17,13.8,0
395,8.71675,18.1,0,0.693,6.471,98.8,1.7257,24,666,20.2,391.98,17.12,13.1,0
396,5.87205,18.1,0,0.693,6.405,96.0,1.6768,24,666,20.2,396.90,19.37,12.5,0
397,7.67202,18.1,0,0.693,5.747,98.9,1.6334,24,666,20.2,393.10,19.92,8.5,0
399,9.91655,18.1,0,0.693,5.852,77.8,1.5004,24,666,20.2,338.16,29.97,6.3,0
402,9.59571,18.1,0,0.693,6.404,100.0,1.6390,24,666,20.2,376.11,20.31,12.1,0
408,7.40389,18.1,0,0.597,5.617,97.9,1.4547,24,666,20.2,314.64,26.40,17.2,0
421,7.02259,18.1,0,0.718,6.006,95.3,1.8746,24,666,20.2,319.98,15.70,14.2,0
423,7.05042,18.1,0,0.614,6.103,85.1,2.0218,24,666,20.2,2.52,23.29,13.4,0
424,8.79212,18.1,0,0.584,5.565,70.6,2.0635,24,666,20.2,3.65,17.16,11.7,0
428,7.36711,18.1,0,0.679,6.193,78.1,1.9356,24,666,20.2,96.73,21.52,11.0,0
429,9.33889,18.1,0,0.679,6.380,95.6,1.9682,24,666,20.2,60.72,24.08,9.5,0
430,8.49213,18.1,0,0.584,6.348,86.1,2.0527,24,666,20.2,83.45,17.64,14.5,0
432,6.44405,18.1,0,0.584,6.425,74.8,2.2004,24,666,20.2,97.95,12.03,16.1,0
433,5.58107,18.1,0,0.713,6.436,87.9,2.3158,24,666,20.2,100.19,16.22,14.3,0
439,9.39063,18.1,0,0.740,5.627,93.9,1.8172,24,666,20.2,396.90,22.88,12.8,0
441,9.72418,18.1,0,0.740,6.406,97.2,2.0651,24,666,20.2,385.96,19.52,17.1,0
442,5.66637,18.1,0,0.740,6.219,100.0,2.0048,24,666,20.2,395.69,16.59,18.4,0
443,9.96654,18.1,0,0.740,6.485,100.0,1.9784,24,666,20.2,386.73,18.85,15.4,0
446,6.28807,18.1,0,0.740,6.341,96.4,2.0720,24,666,20.2,318.01,17.79,14.9,0
447,9.92485,18.1,0,0.740,6.251,96.6,2.1980,24,666,20.2,388.52,16.44,12.6,0
448,9.32909,18.1,0,0.713,6.185,98.7,2.2616,24,666,20.2,396.90,18.13,14.1,0
449,7.52601,18.1,0,0.713,6.417,98.3,2.1850,24,666,20.2,304.21,19.31,13.0,0
450,6.71772,18.1,0,0.713,6.749,92.6,2.3236,24,666,20.2,0.32,17.44,13.4,0
451,5.44114,18.1,0,0.713,6.655,98.2,2.3552,24,666,20.2,355.29,17.73,15.2,0
452,5.09017,18.1,0,0.713,6.297,91.8,2.3682,24,666,20.2,385.09,17.27,16.1,0
453,8.24809,18.1,0,0.713,7.393,99.3,2.4527,24,666,20.2,375.87,16.74,17.8,0
454,9.51363,18.1,0,0.713,6.728,94.1,2.4961,24,666,20.2,6.68,18.71,14.9,0
457,8.20058,18.1,0,0.713,5.936,80.3,2.7792,24,666,20.2,3.50,16.94,13.5,0
458,7.75223,18.1,0,0.713,6.301,83.7,2.7831,24,666,20.2,272.21,16.23,14.9,0
459,6.80117,18.1,0,0.713,6.081,84.4,2.7175,24,666,20.2,396.90,14.70,20.0,0
462,6.65492,18.1,0,0.713,6.317,83.0,2.7344,24,666,20.2,396.90,13.99,19.5,0
463,5.82115,18.1,0,0.713,6.513,89.9,2.8016,24,666,20.2,393.82,10.29,20.2,0
464,7.83932,18.1,0,0.655,6.209,65.4,2.9634,24,666,20.2,396.90,13.22,21.4,0
474,8.05579,18.1,0,0.584,5.427,95.4,2.4298,24,666,20.2,352.58,18.14,13.8,0
475,6.39312,18.1,0,0.584,6.162,97.4,2.2060,24,666,20.2,302.76,24.10,13.3,0
480,5.82401,18.1,0,0.532,6.242,64.7,3.4242,24,666,20.2,396.90,10.74,23.0,0
481,5.70818,18.1,0,0.532,6.750,74.9,3.3317,24,666,20.2,393.07,7.74,23.7,0
482,5.73116,18.1,0,0.532,7.061,77.0,3.4106,24,666,20.2,395.28,7.01,25.0,0
486,5.69175,18.1,0,0.583,6.114,79.8,3.5459,24,666,20.2,392.68,14.98,19.1,0

* Q8. titanic 데이터를 이용하여, 가장 비싼 운임을 내고 탄 사람을 조회하시오.

In [44]:
titanic.sort_values(by=['Fare'], ascending=False).head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C

* Q9. titanic 데이터에서 객실등급 1등급이면서 20대인 남자 탑승객의 평균 운임을 구하시오

In [49]:
titanic.loc[(titanic['Pclass'] == 1) & (titanic['Age'] // 10 == 2)]['Fare'].mean()

101.60379705882355

### 실습 4 : 데이터프레임 수정하기

* Q0. 라이브러리 불러오기

* Q1. 아래 링크를 titanic 변수에 저장하시오.

    * https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic.0.csv

In [53]:
titanic = pd.read_csv('https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic.0.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

* Q2. 연령대( (0,10], (10,20], (20,30], (30,40], (40,50], (50,100]) ) 칼럼을 추가하시오.

    * (0,10] : 0보다 크고, 10보다 작거나 같다.

In [55]:
gens = [0, 10, 20, 30, 40, 50, 100]
labels = ['(0,10]', '(10,20]', '(20,30]', '(30,40]', '(40,50]', '(50,100])']

titanic['Generation'] = pd.cut(titanic['Age'], labels=labels, bins=gens)
titanic[['Age', 'Generation']]

      Age Generation
0    22.0    (20,30]
1    38.0    (30,40]
2    26.0    (20,30]
3    35.0    (30,40]
4    35.0    (30,40]
..    ...        ...
886  27.0    (20,30]
887  19.0    (10,20]
888   NaN        NaN
889  26.0    (20,30]
890  32.0    (30,40]

[891 rows x 2 columns]

* Q3. PassengerId, Name, SibSp, Parch, Ticket, Cabin 열을 삭제하시오.

In [56]:
titanic.head()
titanic.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin'], axis=1, inplace=True)
titanic.head()

   Survived  Pclass     Sex   Age     Fare Embarked Generation
0         0       3    male  22.0   7.2500        S    (20,30]
1         1       1  female  38.0  71.2833        C    (30,40]
2         1       3  female  26.0   7.9250        S    (20,30]
3         1       1  female  35.0  53.1000        S    (30,40]
4         0       3    male  35.0   8.0500        S    (30,40]

* Q4. 성별(Sex) - male, female의 값을 m, f로 변경하시오.

In [61]:
titanic['Sex'] = titanic['Sex'].map({'male': 'm', 'female': 'f'})

In [62]:
titanic.head()

   Survived  Pclass Sex   Age     Fare Embarked Generation
0         0       3   m  22.0   7.2500        S    (20,30]
1         1       1   f  38.0  71.2833        C    (30,40]
2         1       3   f  26.0   7.9250        S    (20,30]
3         1       1   f  35.0  53.1000        S    (30,40]
4         0       3   m  35.0   8.0500        S    (30,40]

### 실습 5 : Group by

* 타이타닉 데이터를 이용하시오

* Q1. 객실 등급별 평균 나이

In [71]:
titanic.groupby(by=['Pclass'], as_index=False)['Age'].mean()

   Pclass        Age
0       1  38.233441
1       2  29.877630
2       3  25.140620

* Q2. 승선 지역별 평균 운임

In [72]:
titanic.groupby(by=['Embarked'], as_index=False)['Fare'].mean()

  Embarked       Fare
0        C  59.954144
1        Q  13.276030
2        S  27.079812

* Q3. 승선 지역별 생존 여부별 탑승객 수

In [73]:
titanic.groupby(by='Embarked', as_index=False)['Survived'].sum()

  Embarked  Survived
0        C        93
1        Q        30
2        S       217

* Q4. 객실 등급별, 생존 여부별, 평균 운임, 최대 운임, 최소 운임

In [80]:
titanic.groupby(by=['Pclass', 'Survived'], as_index=False)[['Fare']].agg(['mean', 'max', 'min'])

                      Fare
                      mean       max      min
Pclass Survived
1      0         64.684007  263.0000   0.0000
       1         95.608029  512.3292  25.9292
2      0         19.412328   73.5000   0.0000
       1         22.055700   65.0000  10.5000
3      0         13.669364   69.5500   0.0000
       1         13.694887   56.4958   0.0000

In [81]:
titanic

     Survived  Pclass Sex   Age     Fare Embarked Generation
0           0       3   m  22.0   7.2500        S    (20,30]
1           1       1   f  38.0  71.2833        C    (30,40]
2           1       3   f  26.0   7.9250        S    (20,30]
3           1       1   f  35.0  53.1000        S    (30,40]
4           0       3   m  35.0   8.0500        S    (30,40]
..        ...     ...  ..   ...      ...      ...        ...
886         0       2   m  27.0  13.0000        S    (20,30]
887         1       1   f  19.0  30.0000        S    (10,20]
888         0       3   f   NaN  23.4500        S        NaN
889         1       1   m  26.0  30.0000        C    (20,30]
890         0       3   m  32.0   7.7500        Q    (30,40]

[891 rows x 7 columns]

In [83]:
titanic.loc[titanic['Age'] < 20, 'Age'] = ' isBaby'

TypeError: '<' not supported between instances of 'str' and 'int'

In [ ]:
ti